//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//  Created by 郑淮予 on 2017/4/27.
//  Copyright © 2017年 郑淮予. All rights reserved.
//

//        /\_/\
//      =( °w° )=
//        )   (         // 单纯的凝视
//       (__ __)


#pragma mark - 别理我 - 
//       __
// __   (__`\
//(__`\   \\`\
// `\\`\   \\ \
//   `\\`\  \\ \
//     `\\`\#\\ \#
//       \_ ##\_ |##
//       (___)(___)##
//        (0)  (0)`\##
//         |~   ~ , \##
//         |      |  \##
//         |     /\   \##         __..---'''''-.._.._
//         |     | \   `\##  _.--'                _  `.
//         Y     |  \    `##'                     \`\  \
//        /      |   \                             | `\ \
//       /_...___|    \                            |   `\\
//      /        `.    |                          /      ##
//     |          |    |                         /      ####
//     |          |    |                        /       ####
//     | () ()    |     \     |          |  _.-'         ##
//     `.        .'      `._. |______..| |-'|
//       `------'           | | | |    | || |
//                          | | | |    | || |
//                          | | | |    | || |
//                          | | | |    | || |
//                    _____ | | | |____| || |
//                   /     `` |-`/     ` |` |
//                   \________\__\_______\__\
//                    """""""""   """""""'"""




#import <UIKit/UIKit.h>
#import "AppDelegate.h"

int main(int argc, char * argv[]) {
    @autoreleasepool {
        return UIApplicationMain(argc, argv, nil, NSStringFromClass([AppDelegate class]));
    }
}
/*
 1.创建UIApplication(1.打开网页,发短信,打电话 2.设置应用程序提醒数字 3.设置联网状态 4.设置状态栏)
 2.创建AppDelegate代理对象,并且成为UIApplication代理,(监听整个app生命周期,处理内存警告)
 3.开启主运行循环,保证程序一直运行(runloop:每一个线程都有runloop,主线程有一个runloop自动开启)
 4.加载info.plist,判断是否指定了main.storyboard,如果指定,就会去加载
 
 1.创建窗口
 2.设置根控制器
 3.显示窗口
 */
